Documents/ПереводДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПереводДенег</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КошелекОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелёк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПереводДенег/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. Проверяем остаток на кошельке-отправителе
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Кошелёк = &Кошелёк
		|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки";
	
	Запрос.УстановитьПараметр("Период",  МоментВремени());
	Запрос.УстановитьПараметр("Кошелёк", КошелекОтправитель); // Проверьте букву Е/Ё!
	Запрос.УстановитьПараметр("Валюта",  КошелекОтправитель.Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекущийОстаток = 0;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекущийОстаток = Выборка.СуммаОстаток;
	КонецЕсли;
	
	// 2. Блокируем перевод, если денег не хватает
	Если ТекущийОстаток < Сумма Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Недостаточно средств для перевода! На кошельке-отправителе доступно: " + ТекущийОстаток + ", требуется: " + Сумма;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	// 3. Если всё хорошо, выполняем двойное движение
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	
	// Списание (Расход)
	ДвижениеРасход = Движения.ОстаткиДенежныхСредств.Добавить();
	ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеРасход.Период      = Дата;
	ДвижениеРасход.Кошелёк     = КошелекОтправитель;
	ДвижениеРасход.Валюта      = КошелекОтправитель.Валюта;
	ДвижениеРасход.Sумма       = Сумма;

	// Зачисление (Приход)
	ДвижениеПриход = Движения.ОстаткиДенежныхСредств.Добавить();
	ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПриход.Период      = Дата;
	ДвижениеПриход.Кошелёк     = КошелекПолучатель;
	ДвижениеПриход.Валюта      = КошелекПолучатель.Валюта;
	ДвижениеПриход.Сумма       = Сумма;

КонецПроцедуры
